In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("adult.csv")

In [3]:
data.sample(4)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
24895,32,Private,193042,Prof-school,15,Married-civ-spouse,Sales,Husband,White,Male,15024,0,60,United-States,>50K
45512,30,Private,269723,HS-grad,9,Never-married,Exec-managerial,Not-in-family,White,Female,0,0,40,United-States,<=50K
2768,38,Private,215392,Assoc-voc,11,Married-civ-spouse,Prof-specialty,Wife,White,Female,7298,0,45,United-States,>50K
31033,28,Private,91299,Assoc-voc,11,Never-married,Adm-clerical,Not-in-family,Asian-Pac-Islander,Female,0,0,45,United-States,<=50K

In [4]:
data.shape

(48842, 15)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [6]:
data.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [7]:
data["race"].unique()

array(['Black', 'White', 'Asian-Pac-Islander', 'Other',
       'Amer-Indian-Eskimo'], dtype=object)

In [8]:
data.gender.unique()

array(['Male', 'Female'], dtype=object)

In [9]:
data.gender.head()

0      Male
1      Male
2      Male
3      Male
4    Female
Name: gender, dtype: object

In [10]:
data.gender.dtypes

dtype('O')

In [11]:
data["gender"] = data["gender"].replace(to_replace = ["Male", "Female"], value = [1, 0])

In [12]:
data.gender.dtype

dtype('int64')

In [13]:
data["workclass"].value_counts()

Private             33906
Self-emp-not-inc     3862
Local-gov            3136
?                    2799
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: workclass, dtype: int64

In [14]:
data.workclass.dtype

dtype('O')

In [15]:
data["workclass"] = data["workclass"].replace(to_replace = "?", value = np.nan)

In [16]:
data["workclass"].value_counts()

Private             33906
Self-emp-not-inc     3862
Local-gov            3136
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: workclass, dtype: int64

In [17]:
data.workclass.dtype

dtype('O')

In [18]:
data.isnull().sum()

age                   0
workclass          2799
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation            0
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country        0
income                0
dtype: int64

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        46043 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  int64
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(7), object(8)
memory usage: 5.6+ MB

In [20]:
data = data.replace(to_replace = "?", value = np.nan)

In [21]:
data.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'educational-num',
       'marital-status', 'occupation', 'relationship', 'race', 'gender',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income'],
      dtype='object')

In [22]:
data.rename(columns = {
    "educational-num" : "educational_num",  
    "marital-status" : "marital_status"
}, inplace = True)

In [23]:
data.rename(columns = {
    "capital-gain" : "capital_gain",
    "capital-loss" : "capital_loss",
    "hours-per-week" : "hours_per_week",
    "native-country" : "native_country"
}, inplace = True)

In [24]:
data.sample(5)

,age,workclass,fnlwgt,education,educational_num,marital_status,occupation,relationship,race,gender,capital_gain,capital_loss,hours_per_week,native_country,income
41677,34,Local-gov,325792,Some-college,10,Married-civ-spouse,Craft-repair,Husband,White,1,0,0,40,United-States,<=50K
13616,57,Private,34366,Some-college,10,Married-civ-spouse,Transport-moving,Husband,White,1,0,0,50,United-States,<=50K
42781,53,Private,264939,Bachelors,13,Never-married,Prof-specialty,Not-in-family,White,0,0,0,45,Mexico,<=50K
11145,47,Private,347088,5th-6th,3,Separated,Other-service,Unmarried,White,0,0,0,40,United-States,<=50K
10488,38,Local-gov,32587,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Amer-Indian-Eskimo,1,0,0,50,United-States,>50K

In [25]:
data.income.unique()

array(['<=50K', '>50K'], dtype=object)

In [26]:
data.income.value_counts()

<=50K    37155
>50K     11687
Name: income, dtype: int64

In [27]:
data["income"] = data["income"].replace(to_replace = ["<=50K", ">50K"], value = [0, 1])

In [28]:
data.head(10)

,age,workclass,fnlwgt,education,educational_num,marital_status,occupation,relationship,race,gender,capital_gain,capital_loss,hours_per_week,native_country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,1,0,0,40,United-States,0
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,1,0,0,50,United-States,0
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,1,0,0,40,United-States,1
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,1,7688,0,40,United-States,1
4,18,NaN,103497,Some-college,10,Never-married,NaN,Own-child,White,0,0,0,30,United-States,0
5,34,Private,198693,10th,6,Never-married,Other-service,Not-in-family,White,1,0,0,30,United-States,0
6,29,NaN,227026,HS-grad,9,Never-married,NaN,Unmarried,Black,1,0,0,40,United-States,0
7,63,Self-emp-not-inc,104626,Prof-school,15,Married-civ-spouse,Prof-specialty,Husband,White,1,3103,0,32,United-States,1
8,24,Private,369667,Some-college,10,Never-married,Other-service,Unmarried,White,0,0,0,40,United-States,0
9,55,Private,104996,7th-8th,4,Married-civ-spouse,Craft-repair,Husband,White,1,0,0,10,United-States,0

In [31]:
data["income"].value_counts()

0    37155
1    11687
Name: income, dtype: int64

In [32]:
data.sample()

,age,workclass,fnlwgt,education,educational_num,marital_status,occupation,relationship,race,gender,capital_gain,capital_loss,hours_per_week,native_country,income
1380,28,Private,632733,Masters,14,Married-civ-spouse,Sales,Husband,White,1,0,0,60,United-States,1

In [34]:
data.describe(include = "all")

,age,workclass,fnlwgt,education,educational_num,marital_status,occupation,relationship,race,gender,capital_gain,capital_loss,hours_per_week,native_country,income
count,48842.000000,46043,4.884200e+04,48842,48842.000000,48842,46033,48842,48842,48842.000000,48842.000000,48842.000000,48842.000000,47985,48842.000000
unique,NaN,8,NaN,16,NaN,7,14,6,5,NaN,NaN,NaN,NaN,41,NaN
top,NaN,Private,NaN,HS-grad,NaN,Married-civ-spouse,Prof-specialty,Husband,White,NaN,NaN,NaN,NaN,United-States,NaN
freq,NaN,33906,NaN,15784,NaN,22379,6172,19716,41762,NaN,NaN,NaN,NaN,43832,NaN
mean,38.643585,NaN,1.896641e+05,NaN,10.078089,NaN,NaN,NaN,NaN,0.668482,1079.067626,87.502314,40.422382,NaN,0.239282
std,13.710510,NaN,1.056040e+05,NaN,2.570973,NaN,NaN,NaN,NaN,0.470764,7452.019058,403.004552,12.391444,NaN,0.426649
min,17.000000,NaN,1.228500e+04,NaN,1.000000,NaN,NaN,NaN,NaN,0.000000,0.000000,0.000000,1.000000,NaN,0.000000
25%,28.000000,NaN,1.175505e+05,NaN,9.000000,NaN,NaN,NaN,NaN,0.000000,0.000000,0.000000,40.000000,NaN,0.000000
50%,37.000000,NaN,1.781445e+05,NaN,10.000000,NaN,NaN,NaN,NaN,1.000000,0.000000,0.000000,40.000000,NaN,0.000000
75%,48.000000,NaN,2.376420e+05,NaN,12.000000,NaN,NaN,NaN,NaN,1.000000,0.000000,0.000000,45.000000,NaN,0.000000
max,90.000000,NaN,1.490400e+06,NaN,16.000000,NaN,NaN,NaN,NaN,1.000000,99999.000000,4356.000000,99.000000,NaN,1.000000

In [37]:
data.isnull().sum()

age                   0
workclass          2799
fnlwgt                0
education             0
educational_num       0
marital_status        0
occupation         2809
relationship          0
race                  0
gender                0
capital_gain          0
capital_loss          0
hours_per_week        0
native_country      857
income                0
dtype: int64

In [52]:
null_values = data.isnull().sum()
null_values = pd.DataFrame(null_values,columns=['null'])
sum_total=len(data)
null_values['percentage'] = null_values['null']/sum_total
round(null_values*100,3).sort_values('percentage',ascending=False)

                   null  percentage
occupation       280900       5.751
workclass        279900       5.731
native_country    85700       1.755
age                   0       0.000
fnlwgt                0       0.000
education             0       0.000
educational_num       0       0.000
marital_status        0       0.000
relationship          0       0.000
race                  0       0.000
gender                0       0.000
capital_gain          0       0.000
capital_loss          0       0.000
hours_per_week        0       0.000
income                0       0.000

In [97]:
print("occupation : ", data.occupation.unique(), "\n")
print("/" * 70)
print("\n", "workclass : ", data.workclass.unique(), "\n")
print("/" * 70)
print("\n", "native_country : ", data.native_country.unique())

occupation :  ['Machine-op-inspct' 'Farming-fishing' 'Protective-serv' 'Prof-specialty'
 'Other-service' 'Craft-repair' 'Adm-clerical' 'Exec-managerial'
 'Tech-support' 'Sales' 'Priv-house-serv' 'Transport-moving'
 'Handlers-cleaners' 'Armed-Forces']

//////////////////////////////////////////////////////////////////////

 workclass :  ['Private' 'Local-gov' 'Self-emp-not-inc' 'Federal-gov' 'State-gov'
 'Self-emp-inc' 'Without-pay' 'Never-worked']

//////////////////////////////////////////////////////////////////////

 native_country :  ['United-States' 'Peru' 'Guatemala' 'Mexico' 'Dominican-Republic'
 'Ireland' 'Germany' 'Philippines' 'Thailand' 'Haiti' 'El-Salvador'
 'Puerto-Rico' 'Vietnam' 'South' 'Columbia' 'Japan' 'India' 'Cambodia'
 'Poland' 'Laos' 'England' 'Cuba' 'Taiwan' 'Italy' 'Canada' 'Portugal'
 'China' 'Nicaragua' 'Honduras' 'Iran' 'Scotland' 'Jamaica' 'Ecuador'
 'Yugoslavia' 'Hungary' 'Hong' 'Greece' 'Trinadad&Tobago'
 'Outlying-US(Guam-USVI-etc)' 'France' 'Holand-Netherlands']

In [90]:
print(data["occupation"].mode(), "\n")
print("/" * 70)
print("\n", data["workclass"].mode(), "\n")
print(print("/" * 70))
print("\n", data["native_country"].mode())

0    Prof-specialty
Name: occupation, dtype: object

//////////////////////////////////////////////////////////////////////

 0    Private
Name: workclass, dtype: object

//////////////////////////////////////////////////////////////////////
None

 0    United-States
Name: native_country, dtype: object

In [84]:
data["occupation"].fillna(data["occupation"].mode()[0], inplace = True)

In [86]:
data["workclass"].fillna(data["workclass"].mode()[0], inplace = True)
data["native_country"].fillna(data["native_country"].mode()[0], inplace = True)

In [88]:
data.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational_num    0
marital_status     0
occupation         0
relationship       0
race               0
gender             0
capital_gain       0
capital_loss       0
hours_per_week     0
native_country     0
income             0
dtype: int64

In [89]:
null_values = data.isnull().sum()
null_values = pd.DataFrame(null_values,columns=['null'])
sum_total=len(data)
null_values['percentage'] = null_values['null']/sum_total
round(null_values*100,3).sort_values('percentage',ascending=False)

                 null  percentage
age                 0         0.0
workclass           0         0.0
fnlwgt              0         0.0
education           0         0.0
educational_num     0         0.0
marital_status      0         0.0
occupation          0         0.0
relationship        0         0.0
race                0         0.0
gender              0         0.0
capital_gain        0         0.0
capital_loss        0         0.0
hours_per_week      0         0.0
native_country      0         0.0
income              0         0.0